{
  "backend/main.mo": "Main Motoko actor defining case tracking types (TaskType, CaseOrigin, Department, etc.), user profiles, access control integration, and public functions for creating/editing cases, managing profiles, and querying statistics with authorization checks.",
  "backend/migration.mo": "Migration module that upgrades actor state from OldActor to NewActor by adding the utilizationStats map while preserving existing caseStore, profileStore, and nextCaseId.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: utilization tracker supporting >100% multi-tasking, UI/UX enhancements, manual time entry fields, and case editing functionality with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend TypeScript/React files describing components, pages, hooks, and utilities for the case tracking application with authentication, theming, and data management.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining colors for backgrounds, cards, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Kipu Tracker Pro application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for Dashboard, BatchEntry, Analytics, and AdminDashboard, wrapped in ThemeProvider with Toaster for notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Empty component file intended for displaying access denied errors when non-admin users attempt admin routes.",
  "frontend/src/components/BreakOverlay.tsx": "Full-screen overlay component displaying animated coffee icon and running timer during break periods with resume button to end break.",
  "frontend/src/components/CaseList.tsx": "Displays a list of the 10 most recent cases with details like task type, duration, EMR case number, and status. Provides an edit button for each case and includes helper functions to format timestamps and map enum values to human-readable labels.",
  "frontend/src/components/CaseTimerControls.tsx": "Provides a timer interface for logging cases with start/stop controls, manual time entry mode, and conditional EMR-specific fields (case origin, type, assistance needed, ticket status, escalation/transfer). Validates required fields and submits cases via the useCreateCase hook.",
  "frontend/src/components/EditCaseModal.tsx": "Modal dialog for editing existing cases with all fields (agent name, task type, times, EMR-specific fields). Validates required fields based on task type and submits updates via the useEditCase hook.",
  "frontend/src/components/Layout.tsx": "Main application layout component with a sticky header containing navigation links (Dashboard, Batch Entry, Analytics, Admin), theme toggle, and footer. Wraps page content and provides consistent structure across routes.",
  "frontend/src/components/LoginButton.tsx": "Empty file with no content.",
  "frontend/src/components/PersonalStats.tsx": "Displays four stat cards showing today's metrics: total cases, active time (excluding breaks), utilization percentage (can exceed 100% for multi-tasking), and average case time. Calculates stats from all cases filtered by today's date.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/ProtectedRoute.tsx": "Empty file with no content.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes using next-themes. Displays sun/moon icons with smooth rotation transitions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token from URL params and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for case management operations including fetching all cases, creating/editing individual cases, and batch case creation with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light/dark theme color palettes using warm coral/teal tones and chart colors for data visualization.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying team-wide statistics (total cases, time spent, average case time) and recent activity feed with case details and task type labels.",
  "frontend/src/pages/Analytics.tsx": "Analytics page that calculates and displays case metrics by task type with CSV export functionality, including comprehensive label mappings for all enum types.",
  "frontend/src/pages/BatchEntry.tsx": "Batch case entry form allowing users to add/remove multiple case entries with validation for required fields, time ranges, and EMR ticket-specific requirements before batch submission.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component that renders personal stats, case timer controls, case list, break overlay, and edit case modal with state management for breaks and case editing.",
  "frontend/src/pages/LoginPage.tsx": "Empty file placeholder for login page component.",
  "frontend/src/utils/timeHelpers.ts": "Utility functions for time handling including conversions between Date objects, datetime-local format, and nanosecond timestamps, plus IST formatting, validation, and duration formatting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme settings for typography, container queries, animations, and design tokens for sidebar, charts, and UI components.",
  "project_state.json": "Project metadata defining a multi-user EMR case tracking system with Internet Identity authentication, personal and admin dashboards, time logging, break management, analytics, and CSV export features built with Motoko backend and React frontend."
}