{
  "backend/main.mo": "Main Motoko actor defining types (TaskType, Case, UserProfile, etc.) and functions for case management, user profiles, utilization stats, and access control with authorization checks on all operations.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence bugs: non-functional Mode toggle button in header navigation and failing case edit functionality in EditCaseModal.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks describing their functionality, styling, state management, and integration patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with sidebar, chart, and UI component color variables.",
  "frontend/index.html": "HTML entry point for the Kipu Tracker Pro application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with Layout wrapper and routes for Dashboard, BatchEntry, Analytics, and AdminDashboard, wrapped in ThemeProvider with Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Empty component file for displaying access denied errors to non-admin users.",
  "frontend/src/components/BreakOverlay.tsx": "Full-screen overlay component displaying animated coffee icon and live timer during break mode with Resume Work button to end break.",
  "frontend/src/components/CaseList.tsx": "Table component displaying recent cases with task type, case number, case type, duration, and edit button; includes helper functions for formatting and labeling.",
  "frontend/src/components/CaseTimerControls.tsx": "Timer control component for tracking work cases with auto/manual time entry modes, supporting EMR-specific fields (case origin, ticket status, escalation) and break functionality. Handles timer start/stop, validation, and case creation via API mutations.",
  "frontend/src/components/EditCaseModal.tsx": "Modal component for editing existing case records with datetime pickers, task type selection, and EMR-specific fields. Validates time ranges and updates cases via the useEditCase mutation hook.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component providing navigation header with links to Dashboard, Batch Entry, Analytics, and Admin pages. Includes theme toggle and mode switcher (auto/manual) that propagates to child components.",
  "frontend/src/components/LoginButton.tsx": "Empty file with no content.",
  "frontend/src/components/PersonalStats.tsx": "Dashboard stats component displaying shift progress and utilization percentages based on today's cases, excluding break times. Calculates remaining shift time using user's shift preferences.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/ProtectedRoute.tsx": "Empty file with no content.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button component using next-themes to switch between light and dark modes with animated sun/moon icons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication. Handles anonymous/authenticated actor creation and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useElapsedTime.ts": "Custom hook that calculates and returns formatted elapsed time (HH:MM:SS) from a start timestamp, updating every second while active.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and cases, including operations like getCallerUserProfile, saveCallerUserProfile, getAllCases, createCase, editCase, deleteCase, and batchCreateCases with proper cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, defining color variables for UI components, charts, buttons, and sidebar elements with a warm palette for light mode and navy blue theme for dark mode.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying team-wide metrics including total cases, total time, average case time, and recent team activity with case details and task type labels.",
  "frontend/src/pages/Analytics.tsx": "Analytics page that calculates and displays case statistics by task type, provides CSV export functionality for all case data with comprehensive field mappings, and shows time-based metrics.",
  "frontend/src/pages/BatchEntry.tsx": "Batch entry page allowing users to create multiple case entries simultaneously with dynamic form rows, validation for required fields based on task type, and bulk submission using batchCreateCases mutation.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component that orchestrates PersonalStats, CaseTimerControls, CaseList, BreakOverlay, and EditCaseModal components with state management for break mode and case editing.",
  "frontend/src/pages/LoginPage.tsx": "Login page component (content truncated in provided input).",
  "frontend/src/utils/timeHelpers.ts": "Utility functions for time handling including conversions between Date objects, datetime-local strings, and nanosecond timestamps, with IST timezone formatting, time range validation, overlap detection, and duration formatting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme settings for borders/shadows/fonts, and animation keyframes for UI components.",
  "project_state.json": "Project metadata describing a multi-user EMR case tracking system with Motoko backend and React frontend, listing existing features, known issues (mode toggle and case edit bugs), and architectural notes about healthcare support workflow implementation."
}